---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetSet.Contains(Autodesk.Revit.DB.Visual.Asset)
source: html/4223edd2-0355-1d11-2be8-114a065a38f2.htm
---
# Autodesk.Revit.DB.Visual.AssetSet.Contains Method

## Syntax (C#)
```csharp
public virtual bool Contains(
	Asset item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Visual.Asset`)